In [4]:
import pandas as pd
Data=[("Arun","19/11/2007","CSE"),("Balaji","15/04/2008","CSE"),("Cheenu","19/3/2008","IT"),("Eeshwar","26/11/2007","ECE")]
df=pd.DataFrame(Data,columns=["Name","DOB","Department"])   
df

      Name         DOB Department
0     Arun  19/11/2007        CSE
1   Balaji  15/04/2008        CSE
2   Cheenu   19/3/2008         IT
3  Eeshwar  26/11/2007        ECE

In [7]:
new_df=pd.DataFrame(Data,columns=["Name","DOB","Department"],index=["S1","S2","S3","S4"])  #custom index
new_df

       Name         DOB Department
S1     Arun  19/11/2007        CSE
S2   Balaji  15/04/2008        CSE
S3   Cheenu   19/3/2008         IT
S4  Eeshwar  26/11/2007        ECE